{
  "backend/main.mo": "Implements invite request and manager management with authorization, round‑robin assignment, and CRUD-style admin operations.",
  "feature_evidence.json": "Feature evidence report documenting deployment fix requirements and affected components.",
  "frontend-file-summaries.txt": "Collection of human-written summaries for all frontend files describing UI components, hooks, and pages.",
  "frontend/index.css": "Defines Tailwind base layers and custom OKLCH design tokens for light and dark themes.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Simple path-based router rendering landing, admin, or member pages.",
  "frontend/src/components/admin/InviteRequestsTable.tsx": "Admin table to view, filter, approve, and reject invite requests.",
  "frontend/src/components/admin/ManagersRoster.tsx": "Admin interface to list, add, and remove managers via dialog and mutations.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth state and query cache resets.",
  "frontend/src/components/pbblack/CallbackRequestFlow.tsx": "Modal flow for submitting a callback request with time window and notes, showing a confirmation screen after submission.",
  "frontend/src/components/pbblack/ComparisonCards.tsx": "Shows a grid of comparison cards listing common insurance service problems with icons.",
  "frontend/src/components/pbblack/Disclaimer.tsx": "Renders an informational disclaimer about PB Black's invite-only nature and service limitations.",
  "frontend/src/components/pbblack/InviteRequestForm.tsx": "Form for submitting an invite request with validation and submission states, showing a confirmation screen when complete.",
  "frontend/src/components/pbblack/InviteStatusChecker.tsx": "Allows users to check invite status by email, displaying status details and manager info when available.",
  "frontend/src/components/pbblack/MeetingSchedulerFlow.tsx": "Modal flow for scheduling a meeting by selecting type, date, time, and notes, followed by a confirmation screen.",
  "frontend/src/components/pbblack/PoliciesSection.tsx": "Displays a list of insurance policies with details and actions to contact or schedule with a manager.",
  "frontend/src/components/pbblack/PremiumButton.tsx": "Wrapper around Button applying premium gold styling for consistent UI.",
  "frontend/src/components/pbblack/PremiumDivider.tsx": "Simple decorative horizontal divider with gold gradient styling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading and managing user identities through AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks and mutations for invite requests, managers, user roles, and related admin actions using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind styles and theme variables with a black‑and‑gold color scheme and custom utility classes.",
  "frontend/src/lib/validators.ts": "Contains simple validators for email, phone numbers, and LinkedIn handles or URLs.",
  "frontend/src/main.tsx": "Sets up the app root with React Query and Internet Identity providers and renders the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin panel with authentication and role checks, showing login, access‑denied, or admin management tabs.",
  "frontend/src/pages/MemberDashboardPage.tsx": "Displays the member dashboard with manager details and flows for callbacks, meetings, and policy interactions.",
  "frontend/src/pages/PBBlackLandingPage.tsx": "Landing page component rendering the PB Black hero, audience sections, premium-themed UI, and navigation helpers including scroll-to-application and admin redirect.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL params, persisting them in sessionStorage, and cleaning them from the URL or hash.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining premium black‑and‑gold theming, fonts, animations, and plugin setup.",
  "project_state.json": "Project state file describing PB Black's goals, architecture notes, features, and known issues for build planning."
}