{
  "backend/main.mo": "Motoko backend defining types and endpoints for premium qualification submissions, user profiles, managers, and authorization with invite link state.",
  "feature_evidence.json": "Feature evidence report describing a deployment-related feature and its associated components and test ID.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files including UI components, pages, hooks, and styling assets.",
  "frontend/index.css": "Global Tailwind CSS setup defining HSL design tokens, dark mode values, and base element styling.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Top‑level React component routing between landing, admin, and member pages using window.location.",
  "frontend/src/components/admin/InviteRequestsTable.tsx": "Admin table listing qualification requests with expandable rows and approve/reject actions.",
  "frontend/src/components/admin/ManagersRoster.tsx": "Admin UI for viewing, adding, and removing manager records using dialog forms and backend mutations.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling authentication state, errors, and query cache clearing.",
  "frontend/src/components/pbblack/CallbackRequestFlow.tsx": "Modal flow for requesting a callback, collecting preferred time and notes, and showing a confirmation screen.",
  "frontend/src/components/pbblack/ClaimsReadinessStatusSection.tsx": "Displays a grid of claims readiness statuses with icons indicating readiness.",
  "frontend/src/components/pbblack/ComparisonCards.tsx": "Renders three feature cards highlighting PB Black service advantages.",
  "frontend/src/components/pbblack/ComparisonTableSection.tsx": "Provides a comparison table showing PB Black features versus traditional advisors.",
  "frontend/src/components/pbblack/ComprehensiveCoverageSection.tsx": "Shows various insurance types covered and emphasizes single‑manager portfolio oversight.",
  "frontend/src/components/pbblack/ContactMyManagerDialog.tsx": "Dialog offering email, phone, and WhatsApp contact options for a user's insurance manager.",
  "frontend/src/components/pbblack/CoverageGapAnalysisSection.tsx": "Lists coverage gaps, underinsured risks, and suggested policy improvements in card format.",
  "frontend/src/components/pbblack/Disclaimer.tsx": "Displays membership and claims‑related disclaimers for PB Black service.",
  "frontend/src/components/pbblack/EcosystemIssuesSection.tsx": "Highlights common issues in traditional insurance management using icon‑based cards.",
  "frontend/src/components/pbblack/EligibilitySection.tsx": "Renders an eligibility section listing four qualification categories with icons and descriptions.",
  "frontend/src/components/pbblack/InviteRequestForm.tsx": "Empty file with no implemented component.",
  "frontend/src/components/pbblack/InviteStatusChecker.tsx": "Provides an email-based invite status checker with validation, API query, and status display UI.",
  "frontend/src/components/pbblack/MeetingSchedulerFlow.tsx": "Implements a meeting scheduling flow allowing users to select meeting type, date, time, and shows a confirmation dialog.",
  "frontend/src/components/pbblack/MomentOfTruthSection.tsx": "Displays claims assistance features highlighting concierge support using a grid of icon-text items.",
  "frontend/src/components/pbblack/PBBlackInsightsSection.tsx": "Shows three advisory insights with icons, titles, and descriptive text in a grid layout.",
  "frontend/src/components/pbblack/PBBlackPrivilegesBlock.tsx": "Lists PB Black privileges with icons inside a styled block section.",
  "frontend/src/components/pbblack/PoliciesSection.tsx": "Renders an accordion list of user insurance policies with details and status indicators.",
  "frontend/src/components/pbblack/PortfolioHealthTopSection.tsx": "Displays concierge info and a portfolio health score with visuals.",
  "frontend/src/components/pbblack/PremiumButton.tsx": "A styled wrapper around Button applying gold-themed premium styling.",
  "frontend/src/components/pbblack/PremiumDivider.tsx": "Renders a horizontal gold gradient divider.",
  "frontend/src/components/pbblack/PremiumQualificationForm.tsx": "Form component that validates user inputs and submits premium qualification data to the backend using a mutation hook. Handles input state, validation, submission, and displays a confirmation state.",
  "frontend/src/components/pbblack/ProofSection.tsx": "Displays three proof-point cards showcasing scale metrics like claim assistants, cities, and seller rank. Uses icons and styled layout for visual emphasis.",
  "frontend/src/components/pbblack/UpcomingActionsSection.tsx": "Renders a list of upcoming insurance-related actions with priority indicators and includes buttons to request callbacks or schedule meetings. Accepts handlers for action buttons via props.",
  "frontend/src/components/pbblack/WhatHappensNextSection.tsx": "Shows a three-step process explaining what happens after submitting a qualification form. Each step includes an icon, step number, title, and description.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity, reinitializing on identity changes and invalidating related queries. Handles anonymous and authenticated actors with optional admin secret setup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient. Handles identity loading, login, logout, and login status management.",
  "frontend/src/hooks/useQueries.ts": "Contains react-query hooks for interacting with backend APIs, including submitting and checking qualifications, managing managers, and checking admin status. Uses the actor from useActor to execute backend calls.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles and a black‑and‑gold theme with custom variables and utilities. Includes typography, gradients, shadows, and animation helpers.",
  "frontend/src/lib/validators.ts": "Provides simple validation functions for email, phone, LinkedIn handles/URLs, and numeric health cover inputs using regex and basic checks.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider before rendering the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that handles authentication, admin role checks, and displays admin tabs or access/login screens accordingly.",
  "frontend/src/pages/MemberDashboardPage.tsx": "Member dashboard showing portfolio health, insights, coverage analysis, actions, policies, privileges, and manager contact flows.",
  "frontend/src/pages/PBBlackLandingPage.tsx": "Landing page for PB Black featuring hero content, qualification CTA, and multiple informational sections about benefits and coverage.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and container settings for the project’s UI styling.",
  "project_state.json": "Describes the PB Black landing page and member dashboard redesign requirements, including visual style, structure, tone, and identity flow. Lists architectural notes, known issues blocking build, and existing feature context for continued development."
}